Revit 2026 API

# SpaceTagSpace Property

---

The space that the tag is associated with.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Space Space { get; }
```
```vb
Public ReadOnly Property Space As Space
	Get
```
```cpp
public:
property Space^ Space {
	Space^ get ();
}
```
```fsharp
member Space : Space with get
```

#### Property Value

Space

In rare cases, the tag may not be associated to a space. The property will be  in these situations.

#### Reference

SpaceTag Class

Autodesk.Revit.DB.Mechanical Namespace